*** Objects

    Lots of stuff are "objects"

    #+NAME: typeof-object
    #+BEGIN_SRC javascript :exports both :session object-types
    typeof({});
    #+END_SRC
    #+NAME: typeof-object2
    #+BEGIN_SRC javascript :exports both :session object-types
    typeof(null);
    #+END_SRC
    #+NAME: typeof-object3
    #+BEGIN_SRC javascript :exports both :session object-types
    typeof([]);
    #+END_SRC

    #+REVEAL: split

    Casting to string can help ?

    #+NAME: typeof-obj-cast-string
    #+BEGIN_SRC javascript :exports both :session object-types
    "Object: '" + String({a: 1}) + "'\n" +
    "Null:   '" + String(null) + "'\n" +
    "Array:  '" + String([1, 2]) + "'";
    #+END_SRC

    #+RESULTS: typeof-obj-cast-string
    : Object: ’[object Object]’
    : Null:   ’null’
    : Array:  ’1,2’

    #+ATTR_REVEAL: :frag roll-in
    Until someone overrides =toString()=

    #+ATTR_REVEAL: :frag roll-in
    #+NAME: typeof-obj-cast-string-oops
    #+BEGIN_SRC javascript :exports both :session object-types
    var myObject = {
      toString() {
        return "Just kiddin";
      }
    };

    String(myObject);
    #+END_SRC

    #+ATTR_REVEAL: :frag roll-in
    #+RESULTS: typeof-obj-cast-string-oops
    
    #+BEGIN_NOTES
    - typeof is useless for objects, of course
    - only way to test for plain object is to cast to string, cool
    - will not work if someone changed .toString() method on object :)
    #+END_NOTES

    #+REVEAL: split

    Only one sure way

    #+NAME: is-plain-objet
    #+BEGIN_SRC javascript :exports code :session toto
    function isPlainObject(value) {
      return typeof(value) === "object" &&
        value !== null &&
        !Array.isArray(value);
    }

    isPlainObject({});
    #+END_SRC

    #+NAME: is-plain-object-calls2
    #+BEGIN_SRC javascript :exports both :session toto
    isPlainObject(null);
    #+END_SRC
    #+NAME: is-plain-object-calls3
    #+BEGIN_SRC javascript :exports both :session toto
    isPlainObject([]);
    #+END_SRC

    #+BEGIN_NOTES
    - only way is to test if object && not array && not null
    #+END_NOTES

    #+REVEAL: split

    Conclusion: never use typeof

    #+REVEAL: split

    Lodash has many type helpers:

    - isArray
    - isDate
    - isInteger
    - isNaN
    - isNil
    - isPlainObject
    - isRegex

